; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	thermograph0 - mode
	infrared3 - mode
	infrared1 - mode
	spectrograph2 - mode
	infrared5 - mode
	thermograph4 - mode
	GroundStation5 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation0 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared5)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared5)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared5)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared3)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared5)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
	(supports instrument9 thermograph0)
	(supports instrument9 infrared5)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 Star3)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
)
(:goal (and
	(pointing satellite2 Phenomenon9)
	(have_image Phenomenon6 infrared5)
	(have_image Phenomenon6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared5)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 infrared5)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 infrared3)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 infrared5)
	(have_image Phenomenon11 thermograph0)
	(have_image Star12 thermograph4)
))

)

; plan
1. (turn_to satellite4 groundstation2 groundstation5)
   deleted: (pointing satellite4 groundstation5)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 13
2. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 13
3. (calibrate satellite4 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 13
4. (turn_to satellite4 phenomenon9 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon9)
   goals met: 0 of 13
5. (take_image satellite4 phenomenon9 instrument6 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 1 of 13
6. (turn_to satellite4 phenomenon7 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon7)
   goals met: 1 of 13
7. (take_image satellite4 phenomenon7 instrument6 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 2 of 13
8. (turn_to satellite4 phenomenon11 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon11)
   goals met: 2 of 13
9. (turn_to satellite2 groundstation4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation4)
   goals met: 2 of 13
10. (turn_to satellite1 star1 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star1)
   goals met: 2 of 13
11. (take_image satellite4 phenomenon11 instrument6 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 3 of 13
12. (take_image satellite4 phenomenon11 instrument6 infrared5)
   added: (have_image phenomenon11 infrared5)
   goals met: 4 of 13
13. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 4 of 13
14. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 4 of 13
15. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 4 of 13
16. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 4 of 13
17. (turn_to satellite1 planet10 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet10)
   goals met: 4 of 13
18. (take_image satellite1 planet10 instrument1 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 5 of 13
19. (turn_to satellite2 star12 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star12)
   goals met: 5 of 13
20. (take_image satellite2 star12 instrument3 thermograph4)
   added: (have_image star12 thermograph4)
   goals met: 6 of 13
21. (turn_to satellite2 phenomenon9 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 phenomenon9)
   goals met: 7 of 13
22. (take_image satellite2 phenomenon9 instrument3 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 8 of 13
23. (turn_to satellite4 phenomenon6 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon6)
   goals met: 8 of 13
24. (take_image satellite4 phenomenon6 instrument6 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 9 of 13
25. (take_image satellite4 phenomenon6 instrument6 infrared5)
   added: (have_image phenomenon6 infrared5)
   goals met: 10 of 13
26. (turn_to satellite4 planet10 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet10)
   goals met: 10 of 13
27. (take_image satellite4 planet10 instrument6 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 11 of 13
28. (turn_to satellite4 star8 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star8)
   goals met: 11 of 13
29. (take_image satellite4 star8 instrument6 infrared1)
   added: (have_image star8 infrared1)
   goals met: 12 of 13
30. (take_image satellite4 star8 instrument6 infrared5)
   added: (have_image star8 infrared5)
   goals met: 13 of 13
